src/cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing @desserts
#+TAGS: GF(g) easy(e) fav(f)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Stuffed Bell Peppers
CLOSED: [2023-05-24 Wed]
:PROPERTIES:
:export_author: Sage
:export_file_name: stuffed-bell-peppers
:export_hugo_custom_front_matter: :servings 6
:export_hugo_custom_front_matter+: :prep-time 15
:export_hugo_custom_front_matter+: :cook-time 40
:export_hugo_custom_front_matter+: :ready-in 55
:END:

*** Ingredients

- 6 to 8 large bell peppers
- 1 1/2 lb extra lean ground beef
- 1 cup rice (raw, cooked becomes 2 cups, not all used)
- 1 Jar Classico four cheeses
- Grated Mozzarella cheese - some in mix, some on peppers to melt in oven
- Olive oil
- Flour to thicken
- 1 stalk Celery, chopped fine
- 6 Mushrooms, chopped fine
- 1/2 cup Additional peppers, chopped fine
- Fresh Parsley, chopped - some in mix, some sprinkled on before serving
- Italian seasoning
- Cumin
- Basil

*** Directions

1. Cut tops off peppers, remove seeds and white part
2. Place on parchment in glass roasting pan, open side up
3. Bake at 375 till peppers smell, and begin to soften
4. Remove from oven and pour out liquid
5. Make rice
6. Cook beef in pan, cutting till pieces are small and uniform
7. Drain off excess grease from the beef.
8. Set aside the beef in a bowl and rinse off the pan with hot water.
9. Heat olive oil in the pan on medium heat.
10. Cook Italian seasoning, basil, cumin, celery, mushrooms
11. Add most of the peppers when above is cooked
12. Add Classico, simmer
13. Add flour to thicken, stir well, simmer,
14. Add mozzarella, simmer
15. Add cooked ground beef, simmer
16. In a large bowl combine meat mixture with as much rice as you want to include
17. (Any leftover filling can be frozen, and used another time)
18. Add the rest of the peppers (these will be less cooked and add colour and crunch)
19. Add most of the parsley
20. Spoon into baked peppers, top with mozzarella
21. Bake at 325 for 40 minutes
22. Just prior to serving top with parsley

